      ******************************************************************
      * SIGLA.....: BHC - BOOTCAMP HACKATHON COBOL
      * PROGRAMA..: BHCP001
      * ANALISTA..: JOSE HILARIO
      * AUTOR.....: MATHEUS KOLLMANN DETERS
      * DATA......: 03/07/2026
      * OBJETIVO..: HELLO WORLD
      * EXECUCAO..: COBOL - BATCH
      ******************************************************************
      * VRS DATA       RESPONSAVEL      DESCRICAO DA VERSAO
      * --- ---------- ---------------- --------------------------------
      * 001 25.06.26   MATHEUS          hello world
      * 002 03.07.26   MATHEUS          SEGUNDO UPDATE POS AULA FINAL
      * --- ---------- ---------------- --------------------------------
      ******************************************************************

      ******************************************************************
       IDENTIFICATION DIVISION.
      ******************************************************************

       PROGRAM-ID. BHCP001.

      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************

      *----------------------------------------
       CONFIGURATION                   SECTION.
      *----------------------------------------
       SPECIAL-NAMES.
            DECIMAL-POINT IS COMMA.

      ******************************************************************
       DATA DIVISION.
      ******************************************************************

      *----------------------------------------
       WORKING-STORAGE                 SECTION.
      *----------------------------------------
       77  CTE-PROG                    PIC X(008) VALUE 'BHCP0001'.
       77  CTE-VERS                    PIC X(006) VALUE 'VRS002'.
      *----------------------------------------
       LOCAL-STORAGE                   SECTION.
      *----------------------------------------

      ******************************************************************
       PROCEDURE DIVISION.
      ******************************************************************
       0000-PRINCIPAL.
            DISPLAY "Hello, COBOL!".
            DISPLAY 'FIM DO PROGRAMA: ' CTE-PROG.
            GOBACK.

       END PROGRAM BHCP001.
