      ******************************************************************
      * SIGLA.....: BHC - BOOTCAMP HACKATHON COBOL
      * PROGRAMA..: BHCP001
      * ANALISTA..: NOME DO ANALISTA
      * AUTOR.....: MATHEUS KOLLMANN DETERS
      * DATA......: 26/06/2026
      * OBJETIVO..: HELLO WORLD
      * EXECUCAO..: COBOL - BATCH
      ******************************************************************
      * VRS DATA       RESPONSAVEL      DESCRICAO DA VERSAO
      * --- ---------- ---------------- --------------------------------
      * 001 25.06.26   MATHEUS          hello world
      * --- ---------- ---------------- --------------------------------
      ******************************************************************

      ******************************************************************
       IDENTIFICATION DIVISION.
      ******************************************************************

       PROGRAM-ID. BHCP001.

      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************

      *----------------------------------------
       CONFIGURATION                   SECTION.
      *----------------------------------------
       SPECIAL-NAMES.
            DECIMAL-POINT IS COMMA.

      ******************************************************************
       DATA DIVISION.
      ******************************************************************

      *----------------------------------------
       WORKING-STORAGE                 SECTION.
      *----------------------------------------

      *----------------------------------------
       LOCAL-STORAGE                   SECTION.
      *----------------------------------------

      ******************************************************************
       PROCEDURE DIVISION.
      ******************************************************************
       0000-PRINCIPAL.
            DISPLAY "Hello, COBOL!".
            GOBACK.

       END PROGRAM BHCP001.
